<div class="alert alert-block alert-info"><H1><font><CENTER><b>PANDAS PRACTICE </b></CENTER></font></H1></div>

In [2]:
import pandas as pd
import numpy as np

## Series
A Series is a one-dimensional array-like object containing a sequence of values and an associated array of data labels, called its index. The simplest Series is formed from only an array of data

In [6]:
ds=pd.Series([2,3,4,5],index=[1,2,3,4])
ds

1    2
2    3
3    4
4    5
dtype: int64

In [7]:
ds.index #This will print index and default index which starts from zero

Int64Index([1, 2, 3, 4], dtype='int64')

In [8]:
ds.values #this will values

array([2, 3, 4, 5])

In [9]:
ds[ds>2]

2    3
3    4
4    5
dtype: int64

In [10]:
ds2={'kolakata':100000,'Mumbai':200000,'Chennai':400000}
ds3=pd.Series(ds2,index={'Bangalore',"Mumbai",'Chennai'}) #Replacing the index with nw one
ds3

Mumbai       200000.0
Chennai      400000.0
Bangalore         NaN
dtype: float64

In [11]:
ds3.index=['Mubai','Gao','Patna'] #Assingninng index valaue
ds3

Mubai    200000.0
Gao      400000.0
Patna         NaN
dtype: float64

In [12]:
ds3.isnull()  #Checking whether a null value is present

Mubai    False
Gao      False
Patna     True
dtype: bool

In [13]:
ds3.notnull()#Checking whether a not null value is present

Mubai     True
Gao       True
Patna    False
dtype: bool

## DataFrame
<div class="alert alert-block alert-info"> A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type </div>

In [14]:
dict_ex={"First Name":["Md","Nishar",'Atif','Majnu'],"Second Name":["Tausif",'Ahmed','Sajjad','Arif'],"Age":[24,25,35,45]}
df1=pd.DataFrame(dict_ex,index=None)
df1

  First Name Second Name  Age
0         Md      Tausif   24
1     Nishar       Ahmed   25
2       Atif      Sajjad   35
3      Majnu        Arif   45

In [15]:
df2=pd.DataFrame(dict_ex,columns=['First Name','Second Name','Age','Address'],index=['One','Two','Three','Four']) 
df2    #Assingning the index value in dataframe

      First Name Second Name  Age Address
One           Md      Tausif   24     NaN
Two       Nishar       Ahmed   25     NaN
Three       Atif      Sajjad   35     NaN
Four       Majnu        Arif   45     NaN

In [16]:
df2.isnull()  #checking whether they have contained a null value

       First Name  Second Name    Age  Address
One         False        False  False     True
Two         False        False  False     True
Three       False        False  False     True
Four        False        False  False     True

In [17]:
df2.loc['Three']  #We can find out the infromation using row

First Name       Atif
Second Name    Sajjad
Age                35
Address           NaN
Name: Three, dtype: object

In [18]:
import numpy as np
df2["Address"]=np.arange(4.)    #Filling the  misssing data

In [19]:
df2

      First Name Second Name  Age  Address
One           Md      Tausif   24      0.0
Two       Nishar       Ahmed   25      1.0
Three       Atif      Sajjad   35      2.0
Four       Majnu        Arif   45      3.0

# REINDEXING

In [20]:
df3=pd.Series(np.arange(6),index=['a','b','c','d','e','f'])
df3

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [21]:
df3=df3.reindex(['f','a','d','c','b','e'])               #reindedxing the colums

In [22]:
df3

f    5
a    0
d    3
c    2
b    1
e    4
dtype: int64

In [23]:
df4 = pd.DataFrame(np.arange(9).reshape((3, 3)), index=['1', '2', '3'],
                     columns=['Kolkata', 'Mumbai', 'Pune'])           #Assigning the columnns with index

In [24]:
df4

   Kolkata  Mumbai  Pune
1        0       1     2
2        3       4     5
3        6       7     8

In [25]:
df4.reindex(columns=['Kolkata','Goa',"Pune"]) #reindexing the columns

   Kolkata  Goa  Pune
1        0  NaN     2
2        3  NaN     5
3        6  NaN     8

## DROPPING AN  ENTRY FROM COLUMN

In [26]:
df5=pd.DataFrame(np.arange(25).reshape(5,5),index=['a','b','c','d','e'],columns=['C1','C2','C3','C4','C5'])
df5

   C1  C2  C3  C4  C5
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [27]:
df5.drop('e')    #Dropping row

   C1  C2  C3  C4  C5
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

In [28]:
df5.drop(columns='C5') #Dropping Columns

   C1  C2  C3  C4
a   0   1   2   3
b   5   6   7   8
c  10  11  12  13
d  15  16  17  18
e  20  21  22  23

In [29]:
df5.drop(columns=['C3','C4'])  #DROPPING MULTIPLE COLUMNS

   C1  C2  C5
a   0   1   4
b   5   6   9
c  10  11  14
d  15  16  19
e  20  21  24

In [30]:
df5.drop(index=['d','e'])  #DROPPING MULTIPLE ROWS

   C1  C2  C3  C4  C5
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14

## INDEXING SELECTION AND FILTERING

In [31]:
ds=pd.Series(np.arange(6),index=['a','b','c','d','e','f'])
ds

a    0
b    1
c    2
d    3
e    4
f    5
dtype: int64

In [32]:
ds['f']   #Finding particular index

5

In [33]:
ds[['b','d','e']] #finding multiple index or row

b    1
d    3
e    4
dtype: int64

In [34]:
ds[1:5]   #Finding with list slicing

b    1
c    2
d    3
e    4
dtype: int64

In [35]:
ds[1:2]=10 #assigning value for particular index

In [36]:
ds

a     0
b    10
c     2
d     3
e     4
f     5
dtype: int64

In [37]:
ds[1:3]=[2,5]  #Assigning for multiple index

In [38]:
ds

a    0
b    2
c    5
d    3
e    4
f    5
dtype: int64

In [39]:
df=pd.DataFrame(np.arange(16).reshape(4,4),columns=['a','b','c','d'],index=['p','q','r','s'])
df

    a   b   c   d
p   0   1   2   3
q   4   5   6   7
r   8   9  10  11
s  12  13  14  15

In [40]:
df['a'] #Finding particular column

p     0
q     4
r     8
s    12
Name: a, dtype: int64

In [41]:
df[['a','b','c']] #Accessing multiple columns

    a   b   c
p   0   1   2
q   4   5   6
r   8   9  10
s  12  13  14

In [42]:
df[df['a']>3]  #Greater than any particular value

    a   b   c   d
q   4   5   6   7
r   8   9  10  11
s  12  13  14  15

In [43]:
df<6     #Checking boolean comaprisons

       a      b      c      d
p   True   True   True   True
q   True   True  False  False
r  False  False  False  False
s  False  False  False  False

## SELECTION WITH LOC AND ILOC
<div class="alert alert-block alert-info"> It enables you to select a subset of the rows and columns from a DataFrame </div>

In [44]:
df=pd.DataFrame(np.arange(1,10).reshape(3,3),index=['p','q','r'],columns=['foo','boo','choo'])
df

   foo  boo  choo
p    1    2     3
q    4    5     6
r    7    8     9

In [45]:
df.loc['p',['foo','choo']]  #loc attribute will show you a row with particular columns data

foo     1
choo    3
Name: p, dtype: int64

In [46]:
df.loc[['q','p'],['foo','choo']] #selecting multiple rows with particular subset of columns

   foo  choo
q    4     6
p    1     3

In [47]:
df.iloc[2,[0,2]]    #selecting second column with particular column(column 0 and cloumn 1 data) element

foo     7
choo    9
Name: r, dtype: int64

In [48]:
df.iloc[1]  #This will select you form rows

foo     4
boo     5
choo    6
Name: q, dtype: int64

In [49]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Kolkata', 'patna', 'Mumbai', 'Delhi'],
                    columns=['one', 'two', 'three', 'four'])
data

         one  two  three  four
Kolkata    0    1      2     3
patna      4    5      6     7
Mumbai     8    9     10    11
Delhi     12   13     14    15

In [137]:
data.iloc[2,[0,3,1]] #Using iloc to find particular data of subset

one      8
four    11
two      9
Name: Mumbai, dtype: int64

In [136]:
data['three']   #Simply use list functionality

Kolkata     2
patna       6
Mumbai     10
Delhi      14
Name: three, dtype: int64

## INTEGERS INDEXES
<div class="alert alert-block alert-info"> This is my first interaction with alert </div>

In [54]:
se=pd.Series(np.arange(4.),index=['a','b','c','d'])
se

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [55]:
se[-1]

3.0

In [60]:
se.loc[:'b']

a    0.0
b    1.0
dtype: float64

In [62]:
se.iloc[:3]

a    0.0
b    1.0
c    2.0
dtype: float64

## ARITHMETIC AND DATA ALIGNMENT

In [63]:
s1=pd.Series(np.arange(4.),index=['a','b','c','d'])
s1

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [65]:
s2=pd.Series([-1.2,2.0,3,1.4],index=['a','b','d','e'])
s2

a   -1.2
b    2.0
d    3.0
e    1.4
dtype: float64

In [66]:
s1+s2  #see here different index has not matched with their respective series

a   -1.2
b    3.0
c    NaN
d    6.0
e    NaN
dtype: float64

In [69]:
df1= pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('abc'), index=['Goa', 'kolkata', 'Mumbai'])
df2= pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('adb'), index=['Utah', 'Goa', 'Mumbai', 'Oregon'])

In [70]:
df1

           a    b    c
Goa      0.0  1.0  2.0
kolkata  3.0  4.0  5.0
Mumbai   6.0  7.0  8.0

In [71]:
df2

          a     d     b
Utah    0.0   1.0   2.0
Goa     3.0   4.0   5.0
Mumbai  6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [72]:
df1+df2 #see here those columns and index doesn't match have produced a NaN value though union

            a     b   c   d
Goa       3.0   6.0 NaN NaN
Mumbai   12.0  15.0 NaN NaN
Oregon    NaN   NaN NaN NaN
Utah      NaN   NaN NaN NaN
kolkata   NaN   NaN NaN NaN

In [73]:
df3=pd.DataFrame({'P':[12,5]})
df3

    P
0  12
1   5

In [74]:
df4=pd.DataFrame({'Q':[10,7]})
df4

    Q
0  10
1   7

In [76]:
df3+df4  #see here if we don't specify index then any operation will give you a NaN value

    P   Q
0 NaN NaN
1 NaN NaN

In [10]:
date=pd.date_range('26/9/2020',periods=30)
df=pd.DataFrame(np.random.randn(30,5),index=date,columns=list('PQRST'))
df

                   P         Q         R         S         T
2020-09-26 -0.306088  1.215302  0.223660 -0.976250  0.468585
2020-09-27  0.625464 -0.648268 -0.481018  0.029604 -0.302531
2020-09-28 -1.410023 -0.638288 -0.688799  0.589831 -0.168353
2020-09-29 -0.514888  0.530467  0.411422 -0.775522 -0.253997
2020-09-30 -0.435850  0.610642  1.103386  1.239990  0.506600
2020-10-01  0.285994  1.112905 -1.297103  1.916400 -1.602465
2020-10-02 -0.489595 -0.120080 -0.921548 -1.049370  0.402415
2020-10-03 -1.210826 -0.051790  0.247399  1.970577 -1.148130
2020-10-04  0.414416 -1.302364  0.442644 -0.230872  2.513563
2020-10-05 -0.349220 -1.258880 -1.034720  0.315414 -0.376856
2020-10-06 -0.387099 -0.304342 -1.044422  0.476587 -0.725043
2020-10-07  1.718448 -0.205416 -1.540839 -0.064872  0.638299
2020-10-08  0.561211 -0.947281 -0.531753 -0.269976  0.405715
2020-10-09 -0.200118 -0.872800 -3.224886  1.499161 -0.864693
2020-10-10  0.649686  0.071477 -0.721714 -0.733302  0.646874
2020-10-11  0.491809  0.268041  1.942870 -1.416473  0.987277
2020-10-12  1.666429 -1.365052  0.471464  1.987045  0.367852
2020-10-13  1.967554  0.237418 -0.326125  1.498101 -0.167907
2020-10-14 -0.124443  0.011339 -0.385872  0.112944  1.122116
2020-10-15 -0.242634  0.643288 -2.232363 -0.829929  0.872586
2020-10-16  1.474704 -0.882768  0.680950 -0.579951  0.621455
2020-10-17  0.337288  2.488710 -2.342824  1.369396  0.307005
2020-10-18 -0.109663 -0.953629 -0.033113 -0.202602 -0.731694
2020-10-19 -0.596855  0.417218  1.889731 -0.659932  1.719376
2020-10-20  0.918185 -1.345364 -0.989797  0.357145 -0.788546
2020-10-21  1.784595 -0.583546 -0.115816 -0.969541 -0.382100
2020-10-22  0.529346  0.610353  0.509471 -1.327345  0.058098
2020-10-23  0.397360  0.364997 -2.650265 -0.682243  1.011762
2020-10-24 -0.933224 -0.008674  1.872405 -0.304465  0.999927
2020-10-25 -0.478918  0.149156  0.524443  0.457135 -0.688405

## ARITHMETIC OPERATIONS WITH FILL VALUES

In [77]:
df1= pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('abc'))
df2=pd.DataFrame(np.arange(16.).reshape((4, 4)), columns=list('abcd'))

In [78]:
df1.loc[1,'c']=np.nan  #I am filling index 1 with corresponding c column value as NaN

In [79]:
df1

     a    b    c
0  0.0  1.0  2.0
1  3.0  4.0  NaN
2  6.0  7.0  8.0

In [82]:
df2

      a     b     c     d
0   0.0   1.0   2.0   3.0
1   4.0   5.0   6.0   7.0
2   8.0   9.0  10.0  11.0
3  12.0  13.0  14.0  15.0

In [80]:
df1+df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0   NaN NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [81]:
df1.add(df2,fill_value=1) #see filling the missing values with 1

      a     b     c     d
0   0.0   2.0   4.0   4.0
1   7.0   9.0   7.0   8.0
2  14.0  16.0  18.0  12.0
3  13.0  14.0  15.0  16.0

In [85]:
df2.reindex(columns=df1.columns,fill_value=1) #Here I am reindexing the values in addition to that i have merge df1 column with df2 and also filling the value

      a     b     c
0   0.0   1.0   2.0
1   4.0   5.0   6.0
2   8.0   9.0  10.0
3  12.0  13.0  14.0

## FUNCTION MAPPING AND APPLICATION

In [4]:
n=int(input("enter the range :"))
def fibonacci(n):
    a=0
    b=1
    li=[]
    for i in range(1,n+1):
        li.append(a)
        c=a+b
        a=b
        b=c
    return li
cube = list(map(lambda x:x**3,fibonacci(n)))
print(cube)

enter the range :10
[0, 1, 1, 8, 27, 125, 512, 2197, 9261, 39304]

In [5]:
x=list(map(lambda x:x**4,[2,4,6,7,9]))
print(x)

[16, 256, 1296, 2401, 6561]

In [3]:
import pandas as pd
import numpy as np
dic=pd.DataFrame(np.arange(9).reshape(3,3),columns=list('abc'))
x=map(lambda x:x['a']*10,dic)
x

In [2]:
list_a = [1, 2, 3]
list_b = [10, 20, 30]
li=list(map(lambda x, y: x + y, list_a, list_b)) 
li

[11, 22, 33]